TrainModule(
  (arch): OnlineSpatialNet(
    (encoder): CausalConv1d(12, 96, kernel_size=(5,), stride=(1,))
    (layers): ModuleList(
      (0): SpatialNetLayer(
        full_share=False
        (fconv1): ModuleList(
          (0): LayerNorm((96,), eps=1e-05, elementwise_affine=True)
          (1): Conv1d(96, 96, kernel_size=(5,), stride=(1,), padding=same, groups=8)
          (2): PReLU(num_parameters=96)
        )
        (norm_full): LayerNorm((96,), eps=1e-05, elementwise_affine=True)
        (squeeze): Sequential(
          (0): Conv1d(96, 8, kernel_size=(1,), stride=(1,))
          (1): SiLU()
        )
        (full): LinearGroup(129, 129, num_groups=8, bias=True)
        (unsqueeze): Sequential(
          (0): Conv1d(8, 96, kernel_size=(1,), stride=(1,))
          (1): SiLU()
        )
        (fconv2): ModuleList(
          (0): LayerNorm((96,), eps=1e-05, elementwise_affine=True)
          (1): Conv1d(96, 96, kernel_size=(5,), stride=(1,), padding=same, groups=8)
          (2): PReLU(num_parameters=96)
        )
        (norm_mhsa): LayerNorm((96,), eps=1e-05, elementwise_affine=True)
        (mhsa): Mamba(
          (in_proj): Linear(in_features=96, out_features=384, bias=False)
          (conv1d): Conv1d(192, 192, kernel_size=(4,), stride=(1,), padding=(3,), groups=192)
          (act): SiLU()
          (x_proj): Linear(in_features=192, out_features=38, bias=False)
          (dt_proj): Linear(in_features=6, out_features=192, bias=True)
          (out_proj): Linear(in_features=192, out_features=96, bias=False)
        )
        (dropout_mhsa): Dropout(p=0.0, inplace=False)
        (norm_tconvffn): LayerNorm((96,), eps=1e-05, elementwise_affine=True)
        (tconvffn): Mamba(
          (in_proj): Linear(in_features=96, out_features=384, bias=False)
          (conv1d): Conv1d(192, 192, kernel_size=(4,), stride=(1,), padding=(3,), groups=192)
          (act): SiLU()
          (x_proj): Linear(in_features=192, out_features=38, bias=False)
          (dt_proj): Linear(in_features=6, out_features=192, bias=True)
          (out_proj): Linear(in_features=192, out_features=96, bias=False)
        )
        (dropout_tconvffn): Dropout(p=0.0, inplace=False)
      )
      (1-7): 7 x SpatialNetLayer(
        full_share=True
        (fconv1): ModuleList(
          (0): LayerNorm((96,), eps=1e-05, elementwise_affine=True)
          (1): Conv1d(96, 96, kernel_size=(5,), stride=(1,), padding=same, groups=8)
          (2): PReLU(num_parameters=96)
        )
        (norm_full): LayerNorm((96,), eps=1e-05, elementwise_affine=True)
        (squeeze): Sequential(
          (0): Conv1d(96, 8, kernel_size=(1,), stride=(1,))
          (1): SiLU()
        )
        (full): LinearGroup(129, 129, num_groups=8, bias=True)
        (unsqueeze): Sequential(
          (0): Conv1d(8, 96, kernel_size=(1,), stride=(1,))
          (1): SiLU()
        )
        (fconv2): ModuleList(
          (0): LayerNorm((96,), eps=1e-05, elementwise_affine=True)
          (1): Conv1d(96, 96, kernel_size=(5,), stride=(1,), padding=same, groups=8)
          (2): PReLU(num_parameters=96)
        )
        (norm_mhsa): LayerNorm((96,), eps=1e-05, elementwise_affine=True)
        (mhsa): Mamba(
          (in_proj): Linear(in_features=96, out_features=384, bias=False)
          (conv1d): Conv1d(192, 192, kernel_size=(4,), stride=(1,), padding=(3,), groups=192)
          (act): SiLU()
          (x_proj): Linear(in_features=192, out_features=38, bias=False)
          (dt_proj): Linear(in_features=6, out_features=192, bias=True)
          (out_proj): Linear(in_features=192, out_features=96, bias=False)
        )
        (dropout_mhsa): Dropout(p=0.0, inplace=False)
        (norm_tconvffn): LayerNorm((96,), eps=1e-05, elementwise_affine=True)
        (tconvffn): Mamba(
          (in_proj): Linear(in_features=96, out_features=384, bias=False)
          (conv1d): Conv1d(192, 192, kernel_size=(4,), stride=(1,), padding=(3,), groups=192)
          (act): SiLU()
          (x_proj): Linear(in_features=192, out_features=38, bias=False)
          (dt_proj): Linear(in_features=6, out_features=192, bias=True)
          (out_proj): Linear(in_features=192, out_features=96, bias=False)
        )
        (dropout_tconvffn): Dropout(p=0.0, inplace=False)
      )
    )
    (decoder): Linear(in_features=96, out_features=2, bias=True)
  )
  (stft): STFT((256, 128, 'hann_window', 256))
  (norm): Norm(utterance, online=True)
  (loss): Loss(loss_func=neg_snr(), pit=False, mask=None)
)


